# Exercise 1
# Напишете програма, в която потребителат трябва да въведе текущата година и годината на своето раждане.
# Програмата изчислява възрастта на потребителя и извейда съобщение.

n = int(input("Въведете текуща година: "))
m = int(input("Въведете година на раждане:"))
print(f"Вашата възраст е: ", n-m)


# Exercise 2
# Напишете програма, в която разстоянието, указано в мили, се преобразува в километри.
# Отчетете, че една миля е равна приблизително на 1,6 километра. 
# Разстоянието в мили се въвежда от потребителя.

m = float(input("Въведете разстояние, измерено в мили: "))
k = 1.6
print(f"Разстоянието, измерено в километри е: ", m*k)



# Exercise 3
# Напишете програма, в която се създава и показва списък, съдържащ степените на двойката
# (числата 2**0, 2**1, 2**2, 2**3 и т.н.).
# Размерът на списъка (броят на числата в списъка) се въвежда от потрбителя.

n = int(input("Въведете цяло число, за да се изчислят степените на двойката: "))
i = 0
number = []
while n > i:
    for x in range(0, n):
        number.append(2 ** x)
        i += 1
print(number)


# Exercise 4
# Напишете програма, в която се създава списък от числа, които при деление на 5 дават остатък 3
# (такива числа се изчисляват по формулара 5k + 3, където k = 0,1,2...).
# Изобразете този списък в прав и обратен ред.

list = []

k = int(input())

for i in range(k + 1):
    number = (5 * i) + 3
    if number % 5 == 3:
        list.append(number)

print(list)
list.sort(reverse = True)
print(list)



# Exercise 5
# Напишете програма, в която се проверява, дели ли се въведеното число от потребителя на 3.
# Отчетете, че ако числото се дели на 3, то остатъкът от делението на това число на 3 е нула.

n = int(input("Въведете число:"))
if n / 3 and n % 3== 0:
    print("Числото се дели на 3 БЕЗ остатък!")
else:
    print("Числото се дели на 3 С остатък!")



# Exercise 6 
# Напишете програма, в която потребителят въвежда три числа, а програмата определа може ли да съществува
# триъгълник със страни, чиято дължина се равнява на въведените стойности. Условието за съществуване на
# триъгълник е следното: сумата на които и да са две числа (от трите въведени) трябва да бъде по-голяма от третото число.

a = float(input("a= "))
b = float(input("b= "))
c = float(input("c= "))
if a+b>c and a+c>b and b+c>a:
    print("Съществува такъв триъгълник!")
else:
    print("Не съществува такъв триъгълник!")



# Exercise 7
# abc; bac; bca; acb; cab; cba; 4 5 8

a = int(input("a= "))
b = int(input("b= "))
c  =int(input("c= "))
if b-a==c-b or a-b==c-a or c-b==a-c or c-a==b-c or a-c==b-a or b-c==a-b:
    print("Числата образуват аритметична прогресия!")
else:
    print("Числата НЕ образуват аритметична прогресия!")