# Exercise 1
# Напишете програма, която намира произведението на числата от 1 до 30, които се делят на 3 и 4.

result = 1
for i in range(1,30,1):
    if i%3==0 and i%4==0:
        result *= i
    print(result)


# Exercise 2
# Напишете програма, която намира средноаритметичното на числата, които се делят на 3 в интервала от 7 до 70.

result=0
a=0
for i in range (7,71):
    if i%3==0:
        result+=i
        a+=1
sredno=result/a
print(f"Rezultata e: {sredno}")


# Exercise 3
# Напишете програма, която по въведено от потребителя число определя:
# Цифрата на единиците да се дели на 5, а цифрата на десетиците четно число ли е.

x=int(input())
if x % 10 == 5:
    print("Cifrata na edinicite se deli na 5")
else:
    print("Cifrata na edinicite ne se deli na 5")
x//=10
if x %2 == 0:
    print("Cifrata na deseticite e chetno")
else:
    print("Cifrata na deseticite ne e chetno")



# Exercise 4
# Напишете програма, която намира сумата на числата от 1 до 50, които се делят на 2 и 3.

result=0
for i in range (1,50,1):
    if i%2==0 and i%3==0:
        result+=i
print(result)



# Exercise 5
# Напишете програма, в която потребителят въвежда цяло число n, след това въвежда n на брой
# числа и намира числото с минимална стойност.

n = int(input('Въведете брой числа: '))
i = 0
list = []
while n > i:
    m = float(input('Въведете числата: '))
    list.append(m)
    i += 1
print(min(list))



# Exercise 6
# Напишете програма, която изчислява лицето S и обиколката P на геометрична фигура, като първо се избира вида на фигурата:
# квадрат, правоъгълник, правоъгълен триъгълник, след което въвежда стойностите за страните на фигурата.

figura = input('Въведете вида фигура, за да се изчисли лицето: ')
if figura == 'квадрат':
    a = int(input('Въведете размера на страната: '))
    P = 4*a
    S = a**2
    print('Периметърът е равен на: ', P)
    print('Лицето е равно на: ', S)
elif figura == 'правоъгълник':
    a = int(input('Въведете размера на едната страна: '))
    b = int(input('Въведете размера на другата страна: '))
    P = 2*(a+b)
    S = a*b
    print('Периметърът е равен на: ', P)
    print('Лицето е равно на: ', S)
elif figura == 'правоъгълен триъгълник':
    a = int(input('Въведете размера на едната страна: '))
    b = int(input('Въведете размера на другата страна: '))
    c = int(input('Въведете размера на третата страна: '))
    P = a + b + c
    S = (a*b)/2
    print('Периметърът е равен на: ', P)
    print('Лицето е равно на: ', S)
else:
    print('Error')

