# Exercise 1
# Да се създадат четири модула на Python, всеки от които да дефинира функция за изчисляване на една аритметична операция, 
# съответно, събиране, изваждане, умножение и деление на въведени от клавиатурата стойности.



# Exercise 2
# Да се създаде приложение, което да изпълнява ролята на калкулатор, изчисляващо аритметичните операции събиране, 
# изваждане, умножение и деление. За целта да се използват създадените модули, които да бъдат извиквани и изпълнявани чрез пакет.

# the modules are located in the "package" folder

from calculator import Calculator

first_object = Calculator(7, 4, "+")
print(first_object.calc())